In [2]:
import numpy as np;
import pandas as pd;

In [3]:
data = {'Name':['Test','Data','Set'],'Age':[12,15,85]}

In [4]:
data

{'Name': ['Test', 'Data', 'Set'], 'Age': [12, 15, 85]}

In [7]:
df = pd.DataFrame(data = data) # We can omit using data key

In [6]:
df

   Name  Age
0  Test   12
1  Data   15
2   Set   85

In [10]:
df.head() # by default head prints first five rows of dataset

   Name  Age
0  Test   12
1  Data   15
2   Set   85

In [11]:
df.tail() # by default tail prints last five rows of dataset

   Name  Age
0  Test   12
1  Data   15
2   Set   85

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 100.0+ bytes

In [16]:
df.columns

Index(['Name', 'Age'], dtype='object')

In [17]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [19]:
df.describe()

             Age
count   3.000000
mean   37.333333
std    41.307788
min    12.000000
25%    13.500000
50%    15.000000
75%    50.000000
max    85.000000

In [20]:
df.Name.describe()

count        3
unique       3
top       Data
freq         1
Name: Name, dtype: object

In [21]:
df.Age.describe()

count     3.000000
mean     37.333333
std      41.307788
min      12.000000
25%      13.500000
50%      15.000000
75%      50.000000
max      85.000000
Name: Age, dtype: float64

In [22]:
df['Name']

0    Test
1    Data
2     Set
Name: Name, dtype: object

In [23]:
df['Age']

0    12
1    15
2    85
Name: Age, dtype: int64

In [24]:
df[['Age','Name']]

   Age  Name
0   12  Test
1   15  Data
2   85   Set

In [27]:
df['Name'].describe()

count        3
unique       3
top       Data
freq         1
Name: Name, dtype: object

## DataFrame using Lists

In [28]:
list = [['Hello','World','Test'],[12,13,14]]

In [29]:
list

[['Hello', 'World', 'Test'], [12, 13, 14]]

In [30]:
df = pd.DataFrame(data = list)

In [34]:
list = np.array(list)

In [35]:
list

array([['Hello', 'World', 'Test'],
       ['12', '13', '14']], dtype='<U5')

In [36]:
list  = np.transpose(list)

In [37]:
list

array([['Hello', '12'],
       ['World', '13'],
       ['Test', '14']], dtype='<U5')

In [40]:
df2 = pd.DataFrame(data = list, columns=['Name','Age'])

In [41]:
df2

    Name Age
0  Hello  12
1  World  13
2   Test  14